<a href="https://colab.research.google.com/github/AnnanyaV/kaggle/blob/master/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
data= pd.read_csv('/content/drive/MyDrive/Kaggle Datasets/train.csv')
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [3]:
data.drop(['Name', 'Ticket'], axis=1, inplace=True)

In [4]:
data['Sex'].unique()

array(['male', 'female'], dtype=object)

In [5]:
d_gender={'male':0, 'female':1}
data['Sex']= data['Sex'].replace(d_gender)

In [6]:
data.head()

   PassengerId  Survived  Pclass  Sex  ...  Parch     Fare  Cabin  Embarked
0            1         0       3    0  ...      0   7.2500    NaN         S
1            2         1       1    1  ...      0  71.2833    C85         C
2            3         1       3    1  ...      0   7.9250    NaN         S
3            4         1       1    1  ...      0  53.1000   C123         S
4            5         0       3    0  ...      0   8.0500    NaN         S

[5 rows x 10 columns]

In [7]:
data['Embarked'].isnull().sum()

2

In [8]:
null_columns=data.columns[data.isnull().any()]
print(data[data["Embarked"].isnull()][null_columns])

      Age Cabin Embarked
61   38.0   B28      NaN
829  62.0   B28      NaN

In [9]:
embarked = data.loc[data.Embarked == 'C']["Survived"]
rate_embarked = sum(embarked)/len(embarked)
print(rate_embarked)

0.5535714285714286

In [10]:
data.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [11]:
data.iloc[61, 9]='S'

In [12]:
data.iloc[829, 9]='S'

In [13]:
data.Embarked.unique()

array(['S', 'C', 'Q'], dtype=object)

In [14]:
data.drop(['SibSp', 'Parch'], axis=1, inplace=True)

In [15]:
data.head()

   PassengerId  Survived  Pclass  Sex   Age     Fare Cabin Embarked
0            1         0       3    0  22.0   7.2500   NaN        S
1            2         1       1    1  38.0  71.2833   C85        C
2            3         1       3    1  26.0   7.9250   NaN        S
3            4         1       1    1  35.0  53.1000  C123        S
4            5         0       3    0  35.0   8.0500   NaN        S

In [16]:
d_Embarked={'S':0, 'C':1, 'Q':2}
data['Embarked']= data['Embarked'].replace(d_Embarked)

In [17]:
 data['Cabin'].isnull().sum()

687

In [18]:
data.drop('Cabin', axis=1, inplace=True)

In [19]:
data.head()

   PassengerId  Survived  Pclass  Sex   Age     Fare  Embarked
0            1         0       3    0  22.0   7.2500         0
1            2         1       1    1  38.0  71.2833         1
2            3         1       3    1  26.0   7.9250         0
3            4         1       1    1  35.0  53.1000         0
4            5         0       3    0  35.0   8.0500         0

In [20]:
y_train= data['Survived']
data.drop('Survived', axis=1, inplace=True)
x_train= data
x_train.head()

   PassengerId  Pclass  Sex   Age     Fare  Embarked
0            1       3    0  22.0   7.2500         0
1            2       1    1  38.0  71.2833         1
2            3       3    1  26.0   7.9250         0
3            4       1    1  35.0  53.1000         0
4            5       3    0  35.0   8.0500         0

In [21]:
y_train

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [22]:
test_data= pd.read_csv('/content/drive/MyDrive/Kaggle Datasets/test.csv')
test_data_two= test_data

In [23]:
test_data.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [24]:
test_data.drop(['Name', 'Ticket'], axis=1, inplace=True)
d_gender={'male':0, 'female':1}
test_data['Sex']= test_data['Sex'].replace(d_gender)
test_data.drop(['SibSp', 'Parch'], axis=1, inplace=True)
d_Embarked={'S':0, 'C':1, 'Q':2}
test_data['Embarked']= test_data['Embarked'].replace(d_Embarked)
test_data.drop('Cabin', axis=1, inplace=True)

In [25]:
test_data.isnull().sum()

PassengerId     0
Pclass          0
Sex             0
Age            86
Fare            1
Embarked        0
dtype: int64

In [26]:
test_data.drop('Age', axis=1, inplace=True)
data.drop('Age', axis=1, inplace=True)

In [27]:
test_data['Fare'] = test_data['Fare'].fillna(test_data['Fare'].mean())

In [28]:
from sklearn.ensemble import RandomForestClassifier

y = y_train

# features = ["Pclass", "Sex", "SibSp", "Parch"]
X =data
X_test = test_data

model = RandomForestClassifier(n_estimators=100, max_depth=5, random_state=1)
model.fit(X, y)
predictions = model.predict(X_test)

print(predictions)

# output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Survived': predictions})
# output.to_csv('my_submission.csv', index=False)
# print("Your submission was successfully saved!")

[0 0 0 0 0 0 0 0 1 0 0 0 1 0 1 1 0 0 0 1 1 0 1 1 1 0 1 0 0 0 0 0 0 0 1 0 0
 0 0 0 0 0 0 1 1 0 1 0 1 0 0 0 1 1 0 0 0 0 0 1 0 0 0 1 1 1 1 0 1 1 1 0 0 1
 1 1 0 1 0 1 0 0 0 0 0 0 1 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 0
 1 1 0 1 0 0 0 1 1 1 0 1 0 0 0 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 0
 0 0 1 0 0 0 0 0 1 0 0 0 1 0 1 0 0 0 0 0 1 0 0 0 0 0 0 1 1 1 1 1 0 1 1 0 1
 0 1 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 1 1 0 0 1 0 1 0 0 0 0 1 0 0 1 0 1 0 1 0
 1 0 1 0 0 1 0 0 0 1 0 0 0 0 1 0 1 1 1 1 1 0 0 0 1 0 1 0 1 0 1 0 0 0 0 0 1
 0 0 0 1 0 0 0 0 0 0 0 1 0 1 1 0 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 1 0 0 0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 1 0 1 1 0 0 1 1 0
 1 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 1 1 0 0 0 0 0 1 0 0 0 0 1 1 0 1 0 0 0 1 0
 0 1 0 0 1 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 1 0 1 0 0 1 0 1 0 1 0 0
 1 1 0 1 1 0 0 1 0 0 0]

In [30]:
output = pd.DataFrame({'PassengerId': test_data_two.PassengerId, 'Survived': predictions})
output.to_csv('my_submission.csv', index=False)